In [1]:
import pandas as pd

In [12]:
df1 = pd.DataFrame({
    'student_id': ['A101', 'A102', 'A103', 'A104', 'A105'],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'gender': ['female', 'male', 'male', 'male', 'female'],
    'age': [20, 21, 19, 20, 22],
    'score_math': [85, 90, 70, 75, 80],
    'score_english': [80, 85, 75, 70, 90]
})

df2 = pd.DataFrame({
    'student_id': ['A101', 'A102', 'A103', 'A104', 'A106'],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Frank'],
    'gender': ['female', 'male', 'male', 'male', 'male'],
    'age': [20, 21, 19, 20, 23],
    'score_math': [85, 90, 70, 75, 95],
    'score_english': [80, 85, 75, 70, 80]
})

df3 = pd.DataFrame({
    'student_id': ['A107', 'A108', 'A109', 'A110', 'A111'],
    'name': ['Grace', 'Helen', 'Iris', 'John', 'Kevin'],
    'gender': ['female', 'female', 'female', 'male', 'male'],
    'age': [21, 20, 19, 22, 20],
    'score_math': [90, 85, 75, 80, 95],
    'score_history': [85, 80, 70, 75, 90]
})

In [13]:
df1

  student_id     name  gender  age  score_math  score_english
0       A101    Alice  female   20          85             80
1       A102      Bob    male   21          90             85
2       A103  Charlie    male   19          70             75
3       A104    David    male   20          75             70
4       A105      Eve  female   22          80             90

In [14]:
df2

  student_id     name  gender  age  score_math  score_english
0       A101    Alice  female   20          85             80
1       A102      Bob    male   21          90             85
2       A103  Charlie    male   19          70             75
3       A104    David    male   20          75             70
4       A106    Frank    male   23          95             80

In [15]:
df3

  student_id   name  gender  age  score_math  score_history
0       A107  Grace  female   21          90             85
1       A108  Helen  female   20          85             80
2       A109   Iris  female   19          75             70
3       A110   John    male   22          80             75
4       A111  Kevin    male   20          95             90

### Problems:
[] Merge df1 and df2 on the student_id column, and save the result to a new DataFrame called merged_df. How many rows and columns does merged_df have?
[] Merge df1 and df3 on the student_id column, and save the result to a new DataFrame called merged_df2. How many rows and columns does merged_df2 have?
[] Concatenate df1, df2, and df3 vertically, and save the result to a new DataFrame called concatenated_df. How many rows and columns does concatenated_df have?
[] Use the isnull() method to find the null values in df1.
[] Use the fillna() method to fill the null values in df1 with the average value of each column.
[] Use the groupby() method to group df1 by the gender column, and calculate the average math score and average English score for each gender.
[] Use the pivot_table() method to create a pivot table from df1, where the rows are the gender column, the columns are the age column (grouped into bins of 2 years), and the values are the average math scores.
[] Use the sort_values() method to sort df1 by the score_math column in descending order.
[] Use the drop_duplicates() method to remove duplicate rows from df1 based on the name column.
[] Use the loc() method to select the rows in df1 where the math score is greater than or equal to 80, and the English score is greater than or equal to 85.
[] Use the apply() method to create a new column in df1 called total_score, which is the sum of the score_math and score_english columns.
[] Use the merge() method to merge df1 and df2 on the student_id column, and specify the how parameter to perform a left join. Save the result to a new DataFrame called merged_df_left. How many rows and columns does merged_df_left have?
[] Use the merge() method to merge df1 and df2 on the student_id column, and specify the how parameter to perform an inner join. Save the result to a new DataFrame called merged_df_inner. How many rows and columns does merged_df_inner have?
[] Use the merge() method to merge df1 and df2 on the student_id column, and specify the how parameter to perform a right join. Save the result to a new DataFrame called merged_df_right. How many rows and columns does merged_df_right have?
[] Use the merge() method to merge df1 and df2 on the student_id column, and specify the how parameter to perform an outer join. Save the result to a new DataFrame called merged_df_outer. How many rows and columns does merged_df_outer have?

In [18]:
# Merge df1 and df2 on the student_id column, and save the result to a new DataFrame called merged_df. How many rows and columns does merged_df have? (on = 'student_id', 'name')
merged_df = pd.merge(df1, df2, on='student_id')
print(f'Number of rows: {merged_df.shape[0]}')
print(f'Number of columns: {merged_df.shape[1]}')
merged_df

Number of rows: 4
Number of columns: 11

,student_id,name_x,gender_x,age_x,score_math_x,score_english_x,name_y,gender_y,age_y,score_math_y,score_english_y
0,A101,Alice,female,20,85,80,Alice,female,20,85,80
1,A102,Bob,male,21,90,85,Bob,male,21,90,85
2,A103,Charlie,male,19,70,75,Charlie,male,19,70,75
3,A104,David,male,20,75,70,David,male,20,75,70

In [20]:
# Merge df1 and df3 on the student_id column, and save the result to a new DataFrame called merged_df2. How many rows and columns does merged_df2 have?
merged_df2 = pd.merge(df1, df3, on='student_id')
print(f'Number of rows: {merged_df2.shape[0]}')
print(f'Number of columns: {merged_df2.shape[1]}')
merged_df2

Number of rows: 0
Number of columns: 11

Empty DataFrame
Columns: [student_id, name_x, gender_x, age_x, score_math_x, score_english, name_y, gender_y, age_y, score_math_y, score_history]
Index: []

In [27]:
# Concatenate df1, df2, and df3 vertically, and save the result to a new DataFrame called concatenated_df. How many rows and columns does concatenated_df have?

concatenated_df = pd.concat([df1, df2, df3])
concatenated_df.reset_index(drop=True, inplace=True)
print(f'Number of rows: {concatenated_df.shape[0]}')
print(f'Number of columns: {concatenated_df.shape[1]}')
print(concatenated_df)

Number of rows: 15
Number of columns: 7
   student_id     name  gender  age  score_math  score_english  score_history
0        A101    Alice  female   20          85           80.0            NaN
1        A102      Bob    male   21          90           85.0            NaN
2        A103  Charlie    male   19          70           75.0            NaN
3        A104    David    male   20          75           70.0            NaN
4        A105      Eve  female   22          80           90.0            NaN
5        A101    Alice  female   20          85           80.0            NaN
6        A102      Bob    male   21          90           85.0            NaN
7        A103  Charlie    male   19          70           75.0            NaN
8        A104    David    male   20          75           70.0            NaN
9        A106    Frank    male   23          95           80.0            NaN
10       A107    Grace  female   21          90            NaN           85.0
11       A108    Helen  female   20          85            NaN           80.0
12       A109     Iris  female   19          75            NaN           70.0
13       A110     John    male   22          80            NaN           75.0
14       A111    Kevin    male   20          95            NaN           90.0

In [29]:
# Drop duplicate
concatenated_df.drop_duplicates(subset='student_id', inplace=True, keep='first', ignore_index=True)
concatenated_df

   student_id     name  gender  age  score_math  score_english  score_history
0        A101    Alice  female   20          85           80.0            NaN
1        A102      Bob    male   21          90           85.0            NaN
2        A103  Charlie    male   19          70           75.0            NaN
3        A104    David    male   20          75           70.0            NaN
4        A105      Eve  female   22          80           90.0            NaN
5        A106    Frank    male   23          95           80.0            NaN
6        A107    Grace  female   21          90            NaN           85.0
7        A108    Helen  female   20          85            NaN           80.0
8        A109     Iris  female   19          75            NaN           70.0
9        A110     John    male   22          80            NaN           75.0
10       A111    Kevin    male   20          95            NaN           90.0

In [30]:
# Use the isnull() method to find the null values in df1.
concatenated_df.isnull()

    student_id   name  gender    age  score_math  score_english  score_history
0        False  False   False  False       False          False           True
1        False  False   False  False       False          False           True
2        False  False   False  False       False          False           True
3        False  False   False  False       False          False           True
4        False  False   False  False       False          False           True
5        False  False   False  False       False          False           True
6        False  False   False  False       False           True          False
7        False  False   False  False       False           True          False
8        False  False   False  False       False           True          False
9        False  False   False  False       False           True          False
10       False  False   False  False       False           True          False

In [32]:
# Use the fillna() method to fill the null values in df1 with the average value of each column.
concatenated_df.fillna("☺️")

   student_id     name  gender  age  score_math score_english score_history
0        A101    Alice  female   20          85          80.0            ☺️
1        A102      Bob    male   21          90          85.0            ☺️
2        A103  Charlie    male   19          70          75.0            ☺️
3        A104    David    male   20          75          70.0            ☺️
4        A105      Eve  female   22          80          90.0            ☺️
5        A106    Frank    male   23          95          80.0            ☺️
6        A107    Grace  female   21          90            ☺️          85.0
7        A108    Helen  female   20          85            ☺️          80.0
8        A109     Iris  female   19          75            ☺️          70.0
9        A110     John    male   22          80            ☺️          75.0
10       A111    Kevin    male   20          95            ☺️          90.0

In [71]:
# [] Use the pivot_table() method to create a pivot table from df1, where the rows are the gender column, the columns are the age column (grouped into bins of 2 years), and the values are the average math scores.
pivot_table = pd.pivot_table(df1, columns='age', aggfunc='mean', values='score_math', index='gender')
pivot_table

age       19    20    21    22
gender
female   NaN  85.0   NaN  80.0
male    70.0  75.0  90.0   NaN

In [33]:
# Use the sort_values() method to sort df1 by the score_math column in descending order.
df1.sort_values(by='score_math', ascending=True)

  student_id     name  gender  age  score_math  score_english
2       A103  Charlie    male   19          70             75
3       A104    David    male   20          75             70
4       A105      Eve  female   22          80             90
0       A101    Alice  female   20          85             80
1       A102      Bob    male   21          90             85

In [73]:
concatenated_df

  student_id     name  gender  age  score_math  score_english  score_history
0       A101    Alice  female   20          85           80.0            NaN
1       A102      Bob    male   21          90           85.0            NaN
2       A103  Charlie    male   19          70           75.0            NaN
3       A104    David    male   20          75           70.0            NaN
4       A105      Eve  female   22          80           90.0            NaN
0       A101    Alice  female   20          85            NaN            NaN
1       A102      Bob    male   21          90            NaN            NaN
2       A103  Charlie    male   19          70            NaN            NaN
3       A104    David    male   20          75            NaN            NaN
4       A106    Frank    male   23          95            NaN            NaN
0       A107    Grace  female   21          90            NaN           85.0
1       A108    Helen  female   20          85            NaN           80.0
2       A109     Iris  female   19          75            NaN           70.0
3       A110     John    male   22          80            NaN           75.0
4       A111    Kevin    male   20          95            NaN           90.0

In [74]:
# Use the drop_duplicates() method to remove duplicate rows from concatenated_df based on the name column.
concatenated_df.drop_duplicates(subset='student_id', keep='first', ignore_index=True)

   student_id     name  gender  age  score_math  score_english  score_history
0        A101    Alice  female   20          85           80.0            NaN
1        A102      Bob    male   21          90           85.0            NaN
2        A103  Charlie    male   19          70           75.0            NaN
3        A104    David    male   20          75           70.0            NaN
4        A105      Eve  female   22          80           90.0            NaN
5        A106    Frank    male   23          95            NaN            NaN
6        A107    Grace  female   21          90            NaN           85.0
7        A108    Helen  female   20          85            NaN           80.0
8        A109     Iris  female   19          75            NaN           70.0
9        A110     John    male   22          80            NaN           75.0
10       A111    Kevin    male   20          95            NaN           90.0

In [75]:
# Use the loc() method to select the rows in df1 where the math score is greater than or equal to 80, and the English score is greater than or equal to 85.
df1.loc[(df1['score_math'] >= 80) & (df1['score_english'] >= 85)]

  student_id name  gender  age  score_math  score_english
1       A102  Bob    male   21          90             85
4       A105  Eve  female   22          80             90

In [78]:
# Use the apply() method to create a new column in df1 called total_score, which is the sum of the score_math and score_english columns.
df1['total_score'] = df1.apply(lambda x: x['score_math'] + x['score_english'], axis=1)
df1

  student_id     name  gender  age  score_math  score_english  total_score
0       A101    Alice  female   20          85             80          165
1       A102      Bob    male   21          90             85          175
2       A103  Charlie    male   19          70             75          145
3       A104    David    male   20          75             70          145
4       A105      Eve  female   22          80             90          170

In [79]:
# Use the merge() method to merge df1 and df2 on the student_id column, and specify the how parameter to perform a left join. Save the result to a new DataFrame called merged_df_left. How many rows and columns does merged_df_left have?
merged_df_left = pd.merge(df1, df2, on='student_id', how='left')
print(f'Number of rows: {merged_df_left.shape[0]}')
print(f'Number of columns: {merged_df_left.shape[1]}')
merged_df_left

Number of rows: 5
Number of columns: 11

,student_id,name_x,gender_x,age_x,score_math_x,score_english,total_score,name_y,gender_y,age_y,score_math_y
0,A101,Alice,female,20,85,80,165,Alice,female,20.0,85.0
1,A102,Bob,male,21,90,85,175,Bob,male,21.0,90.0
2,A103,Charlie,male,19,70,75,145,Charlie,male,19.0,70.0
3,A104,David,male,20,75,70,145,David,male,20.0,75.0
4,A105,Eve,female,22,80,90,170,NaN,NaN,NaN,NaN